[
    {
        "name": "Программист JAVA",
        "url": "https://hh.ru/vacancy/107145061",
        "salary_from": 0,
        "salary_to": 0,
        "description": "Выполнение работ по сопровождению ИС Заказчика. Выполнение запросов на изменение ИС от Заказчика с соблюдением SLA. Построение отчетов по требованиям..."
    },
    {
        "name": "Java-разработчик",
        "url": "https://hh.ru/vacancy/109278261",
        "salary_from": 0,
        "salary_to": 0,
        "description": "Участие в команде реализации комплексного веб-приложения на <highlighttext>Java</highlighttext> и JavaScript по требованиям заказчика. Участие в разработке высоконагруженных банковских приложений. "
    },
    {
        "name": "Java-разработчик middle+/senior",
        "url": "https://hh.ru/vacancy/110415824",
        "salary_from": 200000,
        "salary_to": 250000,
        "description": "Разрабатывать новый функционал и рефакторить существующий. Проектировать и разрабатывать сервисы. Самостоятельно разрабатывать код и тесты, участвовать в тестировании. "
    },
    {
        "name": "Backend разработчик",
        "url": "https://hh.ru/vacancy/109097942",
        "salary_from": 200000,
        "salary_to": 250000,
        "description": "Поддержание, доработка и рефакторинг Legacy кода. Интеграция в внешними сервисами. Ведение и поддержание документации в Swagger и Postman. "
    },
    {
        "name": "QA тестировщик",
        "url": "https://hh.ru/vacancy/110124900",
        "salary_from": 0,
        "salary_to": 400000,
        "description": "Функциональное тестирование — проверка функциональности приложения на соответствие требованиям. Регрессионное тестирование — тестирование существующего функционала после внесения изменений. Интеграционное тестирование — проверка взаимодействия..."
    },
    {
        "name": "Middle QA (Backend/Трайб Digital)",
        "url": "https://hh.ru/vacancy/110195583",
        "salary_from": 0,
        "salary_to": 0,
        "description": "Анализ документации. Написание тест-кейсов. Проведение функционального, регрессионного, интеграционного тестирования. Анализ, локализация, заведение дефектов и контроль их исправления. "
    },
    {
        "name": "QA engineer (Back-end)",
        "url": "https://hh.ru/vacancy/109437310",
        "salary_from": 0,
        "salary_to": 0,
        "description": "Проводить автоматизированное и ручное тестирование для сервисов с GraphQL и REST API. Ставить и сопровождать задачи, направленные на улучшение продукта..."
    },
    {
        "name": "Senior IT Recruiter",
        "url": "https://hh.ru/vacancy/110457079",
        "salary_from": 0,
        "salary_to": 0,
        "description": "Вести подбор на открытые позиции, основной фокус на разработку и инфраструктурные вакансии (<highlighttext>Java</highlighttext>, JavaScript, Python, DevOps). Вести подбор на точечные..."
    },
    {
        "name": "Системный администратор Linux/Junior Devops инженер",
        "url": "https://hh.ru/vacancy/110233431",
        "salary_from": 0,
        "salary_to": 300000,
        "description": "Администрирование и траблшутинг Linux. Администрирования серверов под <highlighttext>Java</highlighttext> приложение. Ansible - написание ролей, автоматизации плейбуков. PostgreSQL - развёртывание в \"кластере\"; репликации, траблшутинг..."
    },
    {
        "name": "QA Engineer (manual и automation)",
        "url": "https://hh.ru/vacancy/110137223",
        "salary_from": 140000,
        "salary_to": 0,
        "description": "Разработка тест-кейсов. Проведение интеграционного и функционального тестирования (как ручных 50%, так и автоматизированных тестов 50%). Поддержка работоспособности полигона. "
    },
    {
        "name": "Инженер-технолог по сопровождению Service Desk (junior java разработчик)",
        "url": "https://hh.ru/vacancy/110306674",
        "salary_from": 0,
        "salary_to": 0,
        "description": "Развитие функционала и поддержка системы на платформе Naumen Service Desk. Разработка встроенных приложений на платформе Naumen Service Desk. "
    },
    {
        "name": "Java-разработчик",
        "url": "https://hh.ru/vacancy/110316836",
        "salary_from": 200000,
        "salary_to": 250000,
        "description": "Разработка нового ПО. - Поддержка и развитие существующего ПО. - Решение интеграционных задач. - Исправление найденных багов. - Покрытие кода тестами. - Улучшение кодовой базы. - "
    },
    {
        "name": "Программист - разработчик",
        "url": "https://hh.ru/vacancy/110113306",
        "salary_from": 0,
        "salary_to": 0,
        "description": "Разработка и поддержка сайтов компании. Поддержка и программирование внутренних ресурсов компании. Поддержка системы внутреннего документооборота компании. Администрирование баз данных и..."
    },
    {
        "name": "DevOps-инженер (Junior)",
        "url": "https://hh.ru/vacancy/110405838",
        "salary_from": 0,
        "salary_to": 0,
        "description": "Поддержка и развитие пайплайнов Jenkins. Развертывание и обслуживание стендов команд разработки web и mobile. Участие во внедрении и сопровождении продуктов..."
    },
    {
        "name": "Java разработчик",
        "url": "https://hh.ru/vacancy/109083972",
        "salary_from": 120000,
        "salary_to": 180000,
        "description": "Разработку и поддержку backend-части нашего продукта на <highlighttext>Java</highlighttext> с использованием Spring boot. Интеграцию с различными внешними сервисами и API. "
    },
    {
        "name": "QA Инженер",
        "url": "https://hh.ru/vacancy/107714291",
        "salary_from": 0,
        "salary_to": 0,
        "description": "Самостоятельная разработка сценариев-тестирования (стратегии тестирования, чек-листов, тест-кейсов). Планирование и организация тестирования (Проводить оценку трудозатрат на проведение тестирования). "
    },
    {
        "name": "Тестировщик (Junior)",
        "url": "https://hh.ru/vacancy/108779919",
        "salary_from": 0,
        "salary_to": 0,
        "description": "Ручное тестирование веб-фронтенда. Ручное тестирование API. Составление и ведение тестовых сценариев, баг-репортов, чек-листов."
    },
    {
        "name": "Инженер-программист промышленных роботов",
        "url": "https://hh.ru/vacancy/110364688",
        "salary_from": 0,
        "salary_to": 0,
        "description": "Программирование промышленных роботов. Отладка работы робототехнических комплексов, выполняющих различные технологические операции: сварка, паллетирование, фрезерование и др. Настройка протоколов обмена данными. "
    },
    {
        "name": "Инженер-тестировщик интеграционного тестирования",
        "url": "https://hh.ru/vacancy/105667786",
        "salary_from": 0,
        "salary_to": 0,
        "description": "Интеграционное функциональное тестирование процессингового ПО. Взаимодействие с партнерами, разработчиками, аналитиками по вопросам интеграционного тестирования. Обнаружение, документирование и отслеживание дефектов. "
    },
    {
        "name": "Data Engineer",
        "url": "https://hh.ru/vacancy/110022563",
        "salary_from": 0,
        "salary_to": 800000,
        "description": "Разработка сервисов интеграции и управления ETL-процессами. Разработка и мониторинг работоспособности процессов по загрузке данных из систем-источников в слои..."
    },
    {
        "name": "Ведущий руководитель проектов",
        "url": "https://hh.ru/vacancy/108991272",
        "salary_from": 0,
        "salary_to": 0,
        "description": "Улучшать процессы, развивать и искать подходящие методологии, адаптировать их под специфику систем. Участвовать в подборе, обучении, адаптации, мотивация сотрудников. "
    },
    {
        "name": "Java-разработчик",
        "url": "https://hh.ru/vacancy/109957597",
        "salary_from": 0,
        "salary_to": 0,
        "description": "Участие в анализе предоставляемых бизнес задач. Формирование плана разработки для достижения поставленных целей. Актуализация системных требований относительно реализуемого функционала. "
    },
    {
        "name": "Java developer (middle+/senior)",
        "url": "https://hh.ru/vacancy/109917321",
        "salary_from": 0,
        "salary_to": 0,
        "description": "Написание и сопровождение <highlighttext>Java</highlighttext>-приложений и REST-сервисов для микросервисной архитектуры. Покрытие разработанного кода unit-тестами. Взаимодействие и интеграция с..."
    },
    {
        "name": "Java-программист (г. Фрязино, Московская область)",
        "url": "https://hh.ru/vacancy/110428541",
        "salary_from": 0,
        "salary_to": 0,
        "description": "Разработка приложений в стеках технологий Oracle, Postgres, <highlighttext>Java</highlighttext>, Cassandra, Apache. Участие в проектировании и планировании. Участвовать во внутренних и внешних..."
    },
    {
        "name": "Специалист сопровождения фронтальных систем",
        "url": "https://hh.ru/vacancy/108659520",
        "salary_from": 0,
        "salary_to": 0,
        "description": "Проводить установку и настройку программного обеспечения в Linux-системах. Осуществлять технологическое обеспечение перехода на более поздние версии программного обеспечения. "
    },
    {
        "name": "Java-разработчик",
        "url": "https://hh.ru/vacancy/108295813",
        "salary_from": 0,
        "salary_to": 0,
        "description": "Настроенный CI, автоматически проверяющий качество кода и отправляющий билд в тестирование. Развитие и разработка новых микросервисов. Участие в обсуждении реализации..."
    },
    {
        "name": "Head of Engineering",
        "url": "https://hh.ru/vacancy/109466516",
        "salary_from": 0,
        "salary_to": 0,
        "description": "Управлять командой разработки, участвовать в найме и развитии команды, выстраивать классные процессы. - Управлять бэклогом команды, распределять задачи и контролировать их..."
    },
    {
        "name": "Middle QA Engineer",
        "url": "https://hh.ru/vacancy/110241357",
        "salary_from": 0,
        "salary_to": 0,
        "description": "Проводить функциональное, нефункциональное, интеграционное, регресионное тестирование Web и Mobile приложений. Тестирование API. Составление, применение и регулярное обновление тестовой документации (тест..."
    },
    {
        "name": "Java Developer",
        "url": "https://hh.ru/vacancy/108323434",
        "salary_from": 0,
        "salary_to": 0,
        "description": "web application (server side) development and support.  data acquisition services (http requests) development using Amazon Lambda serverless technology.  "
    },
    {
        "name": "Программист",
        "url": "https://hh.ru/vacancy/110256335",
        "salary_from": 55000,
        "salary_to": 0,
        "description": "Программно-техническое сопровождение существующих и вновь внедряемых в университете систем дистанционного обучения, информационных образовательных сервисов, систем управления проектами. "
    },
    {
        "name": "Backend-разработчик",
        "url": "https://hh.ru/vacancy/109794643",
        "salary_from": 0,
        "salary_to": 0,
        "description": "Мы используем автоматизированные google apps script таблицы для сбора и обработки данных с помощью api серверного вспомогательного приложения на node.js. "
    },
    {
        "name": "Java разработчик (Java Core)",
        "url": "https://hh.ru/vacancy/109822869",
        "salary_from": 0,
        "salary_to": 0,
        "description": "Разрабатывать новые модели данных на <highlighttext>java</highlighttext> (без Spring!). Решать архитектурные задачи по созданию новых и переработке существующих компонентов, воплощать бизнес..."
    },
    {
        "name": "Lead QA",
        "url": "https://hh.ru/vacancy/110138289",
        "salary_from": 0,
        "salary_to": 0,
        "description": "Ведение стратегии тестирование. Распределение задач по команде QA. Активное участие в груммингах и планнингах. Создавать задачи на автоматизацию тестовых кейсов. "
    },
    {
        "name": "Java Developer",
        "url": "https://hh.ru/vacancy/108585853",
        "salary_from": 0,
        "salary_to": 0,
        "description": "Участие в полном цикле разработки. Развитие архитектуры системы и проектирование функциональности, удобной в использовании. Работа в тесном контакте с бизнесом..."
    },
    {
        "name": "Java-разработчик",
        "url": "https://hh.ru/vacancy/108825875",
        "salary_from": 0,
        "salary_to": 0,
        "description": "Разработка и поддержка приложений на <highlighttext>Java</highlighttext> 11+. Работа с реляционными базами данных (предпочтительно PostgreSQL). Использование Spring Framework (Integration, Boot..."
    },
    {
        "name": "Frontend-разработчик (Middle. Vue | HTML+CSS)",
        "url": "https://hh.ru/vacancy/110254257",
        "salary_from": 160000,
        "salary_to": 0,
        "description": "Делаем: — Цифровые экосистемы для бизнеса и государства: сайты, порталы, интернет-магазины, мобильные приложения, CRM, ERP, сервисы аналитики, финансовой отчетности и..."
    },
    {
        "name": "Middle/Senior QA Engineer",
        "url": "https://hh.ru/vacancy/108152109",
        "salary_from": 0,
        "salary_to": 0,
        "description": "Проведение функционального и регрессионного тестирования. Тестирование пользовательского интерфейса (UI). Разработка тестовой документации. Создание и сопровождение дефектов и контроль их исправления."
    },
    {
        "name": "Java developer(Middle/Senior)",
        "url": "https://hh.ru/vacancy/109687119",
        "salary_from": 0,
        "salary_to": 0,
        "description": "Разработка, поддержка и оптимизация высоконагруженных веб-приложений. Участие в проектировании архитектуры и выбор технологий для новых систем. Взаимодействие с командой..."
    },
    {
        "name": "Специалист отдела тестирования middle manual",
        "url": "https://hh.ru/vacancy/101074608",
        "salary_from": 0,
        "salary_to": 0,
        "description": "Планирование тестирования (Test Management). Создание тестовой документации (Test Design). Проведение тестирования (Test Execution). Анализ результатов (Test Analysis). Рецензирование тест-кейсов..."
    },
    {
        "name": "Java-разработчик",
        "url": "https://hh.ru/vacancy/109885556",
        "salary_from": 0,
        "salary_to": 0,
        "description": "Проведение code review существующих решений в части взаимодействия со средствами криптографической защиты информации (СКЗИ). Проведение поиска уязвимостей, анализ безопасности приложений​."
    },
    {
        "name": "Android разработчик",
        "url": "https://hh.ru/vacancy/109650512",
        "salary_from": 140000,
        "salary_to": 0,
        "description": "Разработка новых функций мобильного приложения Сметтер на Android. Документирование своих действий (внятные комментарии к коммитам, док-блоки в коде). "
    },
    {
        "name": "ТехЛид (ЗамТехДира)",
        "url": "https://hh.ru/vacancy/110145052",
        "salary_from": 0,
        "salary_to": 0,
        "description": "Разработка системной архитектуры вновь разрабатываемых систем. Участие в проектах в роли Архитектора, помощь команде проекта на этапах анализа-разработки-внедрения. "
    },
    {
        "name": "Архитектор информационных систем",
        "url": "https://hh.ru/vacancy/110335574",
        "salary_from": 0,
        "salary_to": 500000,
        "description": "1. Проектирование архитектуры информационных систем. 2. Взаимодействие со стейкхолдерами. Анализ функциональных и нефункциональных требований к системе. 3. Разработка технических спецификаций..."
    },
    {
        "name": "Специалист тестирования (Middle QA)",
        "url": "https://hh.ru/vacancy/108604521",
        "salary_from": 0,
        "salary_to": 0,
        "description": "Локализацией и заведением дефектов. Автоматизацией тестирования (при наличии опыта), наш стек - <highlighttext>Java</highlighttext>, Kotlin, Swift. Анализом проведенных авто-тестов. "
    },
    {
        "name": "Backend-разработчик PHP / Битрикс",
        "url": "https://hh.ru/vacancy/109427571",
        "salary_from": 160000,
        "salary_to": 0,
        "description": "Корпоративным сайтом крупной компании с высокими требованиями к качеству и отказоустойчивости (Битрикс). Сайтом конкурсов с сервисами для организаторов и модераторов..."
    },
    {
        "name": "Java разработчик",
        "url": "https://hh.ru/vacancy/110446093",
        "salary_from": 0,
        "salary_to": 0,
        "description": "В качестве базы данных Oracle. Участвовать в разработке бэкенда автоматизированной банковской системы. Участвовать в разработке узлов взаимодействия с программным обеспечением..."
    },
    {
        "name": "Java-разработчик",
        "url": "https://hh.ru/vacancy/108771465",
        "salary_from": 0,
        "salary_to": 0,
        "description": "Сопровождение существующего ПО компании. Участие в разработке на языках <highlighttext>Java</highlighttext>. Участие в цикле разработки. Используемый стек технологий: <highlighttext>Java</highlighttext> 8, PostgreSQL..."
    },
    {
        "name": "Специалист по тестированию банковского ПО",
        "url": "https://hh.ru/vacancy/107695112",
        "salary_from": 0,
        "salary_to": 0,
        "description": "Тестирование разрабатываемых приложений. Написание тест-кейсов. Развертывание и сопровождение приложений. Диагностика и устранение проблем, контроль работоспособности приложений и предупреждение критических..."
    },
    {
        "name": "Java разработчик",
        "url": "https://hh.ru/vacancy/110134915",
        "salary_from": 0,
        "salary_to": 0,
        "description": "Разрабатывать и поддерживать микросервисы для обработки потоков данных. Оптимизировать компоненты высоконагруженной системы. Реализовывать и поддерживать интеграции микросервисов с брокерами сообщений..."
    },
    {
        "name": "Java Developer (транспортная логистика)",
        "url": "https://hh.ru/vacancy/110221155",
        "salary_from": 0,
        "salary_to": 0,
        "description": "Разработка и оптимизация алгоритмов для агентных моделей на основе <highlighttext>Java</highlighttext> и MATSim. Работа с графами и сетями для оптимизации маршрутов..."
    },
    {
        "name": "Java-разработчик",
        "url": "https://hh.ru/vacancy/109154075",
        "salary_from": 100000,
        "salary_to": 100000,
        "description": "Описания нет"
    },
    {
        "name": "Разработчик React.JS",
        "url": "https://hh.ru/vacancy/109290981",
        "salary_from": 0,
        "salary_to": 0,
        "description": "Разработка клиентской части приложений, включая визуализацию картографических данных, табличной информации, дашбордов. Разработка прототипов UI по макетам. Участие в разработке архитектуры..."
    },
    {
        "name": "Java разработчик (Java Core)",
        "url": "https://hh.ru/vacancy/109822868",
        "salary_from": 0,
        "salary_to": 0,
        "description": "Разрабатывать новые модели данных на <highlighttext>java</highlighttext> (без Spring!). Решать архитектурные задачи по созданию новых и переработке существующих компонентов, воплощать бизнес..."
    },
    {
        "name": "Middle Java developer",
        "url": "https://hh.ru/vacancy/109129191",
        "salary_from": 170000,
        "salary_to": 0,
        "description": "Описания нет"
    },
    {
        "name": "Junior Java Developer",
        "url": "https://hh.ru/vacancy/110000094",
        "salary_from": 0,
        "salary_to": 0,
        "description": "Описания нет"
    },
    {
        "name": "Java-разработчик (Бэкенд)",
        "url": "https://hh.ru/vacancy/104905420",
        "salary_from": 0,
        "salary_to": 0,
        "description": "Написания качественного и понятного кода. Разработка программных алгоритмов, тестов, профилирование, документирование. Рефакторинг и оптимизация кода. Работа в команде."
    },
    {
        "name": "Java-разработчик (middle)",
        "url": "https://hh.ru/vacancy/105829113",
        "salary_from": 0,
        "salary_to": 0,
        "description": "JPA (API <highlighttext>Java</highlighttext> EE). Разработка и оптимизация серверной части платформы. Поддержка существующих и разработка новых решений. Диагностирование ошибок и сбоев..."
    },
    {
        "name": "Backend разработчик (Middle)",
        "url": "https://hh.ru/vacancy/109932408",
        "salary_from": 150000,
        "salary_to": 210000,
        "description": "Написание и сопровождение <highlighttext>Java</highlighttext>-приложений и REST-сервисов для микросервисной архитектуры. Качественное покрытие разработанного кода unit-тестами. Взаимодействие и интеграция..."
    },
    {
        "name": "Стажер-Тестировщик ПО (Автоматизатор)",
        "url": "https://hh.ru/vacancy/110064832",
        "salary_from": 0,
        "salary_to": 0,
        "description": "Как подать заявку?"
    },
    {
        "name": "Руководитель отдела разработки ПО",
        "url": "https://hh.ru/vacancy/110231177",
        "salary_from": 0,
        "salary_to": 0,
        "description": "Формирование команд разработчиков. Распределение задач между командами. Обеспечение темпа и качества разработки на максимально высоком уровне. Выбор и внедрение вспомогательных..."
    },
    {
        "name": "QA Engineer",
        "url": "https://hh.ru/vacancy/110242988",
        "salary_from": 0,
        "salary_to": 0,
        "description": "Разрабатывать и выполнять комплексные тест-планы и тест-кейсы для новых и существующих функций. Проводить функциональное, smoke, интеграционное тестирование. "
    },
    {
        "name": "Программист Backend .NET/ С# + Java",
        "url": "https://hh.ru/vacancy/110338822",
        "salary_from": 50000,
        "salary_to": 100000,
        "description": "Использование юнит-тестирования в разработке."
    },
    {
        "name": "Java-разработчик",
        "url": "https://hh.ru/vacancy/109674490",
        "salary_from": 150000,
        "salary_to": 0,
        "description": "Работа с Docker."
    },
    {
        "name": "QA Lead",
        "url": "https://hh.ru/vacancy/110332243",
        "salary_from": 0,
        "salary_to": 0,
        "description": "Проведение оценки задач на тестирование. Проведение работ по тестированию в рамках функционального, интеграционного, регрессионного этапов тестирования. Управление дефектами. "
    },
    {
        "name": "Инженер по автотестированию/QA Engineer",
        "url": "https://hh.ru/vacancy/108651311",
        "salary_from": 0,
        "salary_to": 0,
        "description": "Участие в церемониях команды (регулярные стендапы, демо, ретро и т.д.). Проведение ручного и автоматизированного тестирования. Написание тест-кейсов и..."
    },
    {
        "name": "Android Engineer (Homopage) | Android разработчик",
        "url": "https://hh.ru/vacancy/110137365",
        "salary_from": 0,
        "salary_to": 0,
        "description": "Развивать домен Checkout. Разрабатывать новые фичи домена в кросс-функциональной команде. Совместно с Product Owner’ом формировать цели и достигать..."
    },
    {
        "name": "FrontEnd Developer",
        "url": "https://hh.ru/vacancy/109671860",
        "salary_from": 0,
        "salary_to": 0,
        "description": "Разработка web-интерфейсов и сервисов для масштабного проекта. Разработка web-интерфейсов для уже существующих приложений на desktop. Разработка нового функционала..."
    },
    {
        "name": "Инженер-программист C++/Java",
        "url": "https://hh.ru/vacancy/110189665",
        "salary_from": 0,
        "salary_to": 0,
        "description": "Разрабатывать новое и дорабатывать существующее программное обеспечение. Интегрировать программные модули между собой. Анализировать, оптимизировать и тестировать код. Участвовать в подготовке..."
    },
    {
        "name": "Тестировщик ПО/QA engineer",
        "url": "https://hh.ru/vacancy/107851220",
        "salary_from": 0,
        "salary_to": 0,
        "description": "Функциональное, регрессионное, UI тестирование в ручном режиме. Автоматизация и оптимизация процесса тестирования. Регистрация ошибок в bug tracking system. "
    },
    {
        "name": "Java-разработчик",
        "url": "https://hh.ru/vacancy/110120537",
        "salary_from": 200000,
        "salary_to": 250000,
        "description": "Разработка и проектирование частей системы: Ядро системы (торговый сервер): Spring boot 2, <highlighttext>java</highlighttext>11+, многопоточность, высокая нагрузка, сложная настраиваемая..."
    },
    {
        "name": "Тестировщик ПО",
        "url": "https://hh.ru/vacancy/95148157",
        "salary_from": 0,
        "salary_to": 0,
        "description": "Разработка, отладка, прогон процедур верификации на стендах. Оформление результатов отладки, прогона. Анализ полученных результатов отладки, прогона. Регистрация выявленных проблем в..."
    },
    {
        "name": "Java-разработчик",
        "url": "https://hh.ru/vacancy/108736541",
        "salary_from": 180000,
        "salary_to": 250000,
        "description": "Разработка нового приложения с нуля и кастомизация существующей систем. Участие в проекте по автоматизации хэджа и страхованию рисков. "
    },
    {
        "name": "Разработчик ML",
        "url": "https://hh.ru/vacancy/109469705",
        "salary_from": 0,
        "salary_to": 0,
        "description": "Разработка и интеграция интеллектуальных алгоритмов компьютерного зрения для решения специфических задач, с использованием современных технологий и методов машинного обучения. "
    },
    {
        "name": "Инженер-программист",
        "url": "https://hh.ru/vacancy/109806281",
        "salary_from": 80000,
        "salary_to": 0,
        "description": "Доработка нетиповых конфигурационных решений на технологической платформе 1С Предприятие 8.3. Анализ существующего программного кода. Участие в проектах автоматизации..."
    },
    {
        "name": "Frontend-разработчик (React)",
        "url": "https://hh.ru/vacancy/109540322",
        "salary_from": 100000,
        "salary_to": 150000,
        "description": "Суть проекта заключается в разработке приложения-мессенджера для мобильного телефона, специально адаптированного для определённой целевой аудитории, с интеграцией различных сервисов."
    },
    {
        "name": "Java-разработчик",
        "url": "https://hh.ru/vacancy/109941805",
        "salary_from": 0,
        "salary_to": 0,
        "description": "Хранение и агрегацию событий потребления на счетах клиентов. Учёт движения средств по счетам клиентов. Учёт контролируемого объема услуг, предоставленных абонентам. "
    },
    {
        "name": "Аналитик",
        "url": "https://hh.ru/vacancy/110123512",
        "salary_from": 0,
        "salary_to": 0,
        "description": "Аналитическая проработка требований. Формирование постановок задач разработчикам. Написание технических заданий и функциональных требований. Консультирование заказчика по реализованному функционалу платформы. "
    },
    {
        "name": "Java Developer (Middle/Senior)",
        "url": "https://hh.ru/vacancy/110310983",
        "salary_from": 0,
        "salary_to": 0,
        "description": "Разработка и поддержка микросервисов. Оптимизация и модернизация существующих систем. Поддержка и улучшение архитектуры backend-решений. Участие в проектировании, разработке и..."
    },
    {
        "name": "Тестировщик ПО/QA engineer",
        "url": "https://hh.ru/vacancy/107851046",
        "salary_from": 0,
        "salary_to": 0,
        "description": "Функциональное, регрессионное, UI тестирование в ручном режиме. Автоматизация и оптимизация процесса тестирования. Регистрация ошибок в bug tracking system. "
    },
    {
        "name": "Java-разработчик",
        "url": "https://hh.ru/vacancy/109549823",
        "salary_from": 0,
        "salary_to": 0,
        "description": "Участвовать в разработке интересных и сложных проектов. Писать код с \"нуля\", участвовать в проектировании архитектуры, а также поддерживать существующий. "
    },
    {
        "name": "Java Developer",
        "url": "https://hh.ru/vacancy/109686367",
        "salary_from": 0,
        "salary_to": 0,
        "description": "Создание нового функционала и улучшение существующего ПО. Написание чистого и оптимизированного кода. Обеспечение высокого качества ПО, используя проверенные паттерны и..."
    },
    {
        "name": "Архитектор (Solution Architect) в офис",
        "url": "https://hh.ru/vacancy/109293534",
        "salary_from": 0,
        "salary_to": 600000,
        "description": "Активное изучение существующей кодовой базы на C# / <highlighttext>Java</highlighttext> / JS / SQL. Извлечение и конвертация полученной информации в описание контрактов взаимодействия компонентов. "
    },
    {
        "name": "Backend-разработчик (Java)",
        "url": "https://hh.ru/vacancy/109762841",
        "salary_from": 0,
        "salary_to": 0,
        "description": "Участие на всех этапах жизненного цикла разрабатываемого продукта в роли разработчика АС — разработка, как нового, так и развитие уже существующего..."
    },
    {
        "name": "Java backend разработчик",
        "url": "https://hh.ru/vacancy/109118206",
        "salary_from": 0,
        "salary_to": 200000,
        "description": "Разные проекты на выбор."
    },
    {
        "name": "Software engineer (Java)",
        "url": "https://hh.ru/vacancy/110034320",
        "salary_from": 0,
        "salary_to": 0,
        "description": "Работать с перспективным технологическим стеком."
    },
    {
        "name": "Андройд Разработчик",
        "url": "https://hh.ru/vacancy/110423179",
        "salary_from": 800000,
        "salary_to": 1000000,
        "description": "Разработка и поддержка Android-приложений для корпоративных и AI-платформ, начиная от концепции до выпуска в продакшен. Реализация пользовательских интерфейсов..."
    },
    {
        "name": "QA Engineer / Инженер по тестированию",
        "url": "https://hh.ru/vacancy/107137935",
        "salary_from": 0,
        "salary_to": 0,
        "description": "Писать и корректировать тест-кейсы. При желании развиваться в автоматизации и покрывать новую функциональность автотестами на Kotlin/<highlighttext>Java</highlighttext> с использованием..."
    },
    {
        "name": "QA Engineer",
        "url": "https://hh.ru/vacancy/110288856",
        "salary_from": 0,
        "salary_to": 0,
        "description": "Проведение ручного (функционального) тестирования банковского ПО. Работа с дефектами в баг-трекинговой системе. Составление тестовой документации (тест-кейсов и сценариев). "
    },
    {
        "name": "Middle Manual QA Engineer",
        "url": "https://hh.ru/vacancy/109239766",
        "salary_from": 0,
        "salary_to": 0,
        "description": "Проведение ручного и автоматизированного тестирования. Участие в оптимизации процессов тестирования в подразделении. Разработка отчетов по результатам тестирования. Взаимодействие с командами..."
    },
    {
        "name": "Backend Java разработчик",
        "url": "https://hh.ru/vacancy/109297953",
        "salary_from": 0,
        "salary_to": 120000,
        "description": "Разработка нового функционала по поставленным задачам. Поддержка существующих проектов. Создание API сервисов REST и gRPC."
    },
    {
        "name": "Инженер по ручному тестированию (middle/senior)",
        "url": "https://hh.ru/vacancy/108251616",
        "salary_from": 0,
        "salary_to": 0,
        "description": "...и таких же «легаси» тестов) высоконагруженного интеграционного web-приложения на <highlighttext>Java</highlighttext>. Тесная работа в команде с аналитиками, разработчиками и тестировщиками..."
    },
    {
        "name": "Стажер/ Младший системный аналитик",
        "url": "https://hh.ru/vacancy/108962707",
        "salary_from": 0,
        "salary_to": 0,
        "description": "Решения, построенные на платформе SOLAR, дают нашим клиентам возможность применять самые современные и передовые технологии (электронные кошельки, бесконтактные платежи - MirPay..."
    },
    {
        "name": "Руководитель департамента разработки",
        "url": "https://hh.ru/vacancy/108481634",
        "salary_from": 0,
        "salary_to": 0,
        "description": "Внедрить релизный подход к обновлению действующих систем. Внедрить CI/CD (совместно с DevOps-инженером), сопроводить внедрение Kubernetes. Управление отделом разработки..."
    },
    {
        "name": "Event-менеджер / организатор мероприятий",
        "url": "https://hh.ru/vacancy/109240412",
        "salary_from": 100000,
        "salary_to": 160000,
        "description": "Мероприятия организуются командой event-менеджеров, в вашей зоне контроля: реализация конференции, выполнение задач в срок, качество реализации, финансовые сметы. "
    },
    {
        "name": "UX/UI разработчик",
        "url": "https://hh.ru/vacancy/109747359",
        "salary_from": 50000,
        "salary_to": 0,
        "description": "Работа с интерфейсом ( UI|UX)."
    },
    {
        "name": "Инженер по тестированию ПО",
        "url": "https://hh.ru/vacancy/110257620",
        "salary_from": 300000,
        "salary_to": 500000,
        "description": "Составление и поддержка тестовой документации. - Анализ требований. - Функциональное и нефункциональное тестирование веб-сайта и бэкенда. - Тестирование API и баз данных. - "
    },
    {
        "name": "Backend разработчик",
        "url": "https://hh.ru/vacancy/109729229",
        "salary_from": 0,
        "salary_to": 0,
        "description": "Backend часть работы с артефактами кредитного процесса онлайн на платформе Банка. Разработка элементов процесса рассмотрения заявки на кредит. "
    },
    {
        "name": "Java-разработчик",
        "url": "https://hh.ru/vacancy/103529756",
        "salary_from": 0,
        "salary_to": 0,
        "description": "Реализация <highlighttext>Java</highlighttext>-микросервисов продукта и его поддержка. Работа с базами данных PostgreSQL, Clickhouse, а также работа с поисковым движком OpenSearch. "
    },
    {
        "name": "Стажер QA",
        "url": "https://hh.ru/vacancy/107468833",
        "salary_from": 0,
        "salary_to": 0,
        "description": "Изучать предметную область и программные продукты компании. Изучать используемые технологии и методологии. Выполнять исследовательские и тестовые работы: сбор данных и..."
    },
    {
        "name": "Функциональный тестировщик с навыками автоматизации",
        "url": "https://hh.ru/vacancy/108951743",
        "salary_from": 0,
        "salary_to": 150000,
        "description": "Опыт разработки и актуализации тестовой документации (тест-планы, чек-листы, тестовые сценарии, баг-репорты, отчёты о тестировании). - Опыт взаимодействия с..."
    }
]